tractionapi/app/controllers/website_controller.rb

SELECT "websites".* FROM "websites"
---
  def index
    render json: Website.all

SELECT  "websites".* FROM "websites" WHERE "websites"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @website = Website.find(params[:id])

SELECT  "websites".* FROM "websites" WHERE "websites"."rank" = ? LIMIT 1  [["rank", 4]]
UPDATE "websites" SET "page_views_per_user" = ?, "updated_at" = ? WHERE "websites"."id" = ?  [["page_views_per_user", 10.2], ["updated_at", "2015-12-31 20:48:36.540502"], ["id", 3]]
---
  def update
    website = Website.find_by(rank: params[:rank])
    if website.update(website_params)